; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips :typing)
  (:types block)
  (:predicates (on ?x - block ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

    (:action dead-end-stack
  	     :parameters (?x - block ?y - block)
  	     :precondition (and (holding ?x) (clear ?y))
  	     :effect
  	     (and (not (holding ?x))
  		   (not (clear ?y))
  		   (clear ?x)
  		   ;; REMOVED: (handempty)
  		   (on ?x ?y)
  		 ))

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x - block ?y - block)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x - block ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-10-2)
(:domain BLOCKS)
(:objects DUMMY B G E D F H I A C J - block)
(:INIT (CLEAR J) (CLEAR C) (ONTABLE A) (ONTABLE C) (ON J I) (ON I H) (ON H F)
 (ON F D) (ON D E) (ON E G) (ON G B) (ON B A) (HANDEMPTY))
(:goal (AND (ON B E) (ON E I) (ON I G) (ON G H) (ON H C) (ON C A) (ON A F)
            (ON F J) (ON J D)))
)

; plan
1. (unstack j i)
   deleted: (clear j) (handempty) (on j i)
   added: (holding j) (clear i)
   goals met: 0 of 9
2. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 0 of 9
3. (unstack i h)
   deleted: (clear i) (handempty) (on i h)
   added: (holding i) (clear h)
   goals met: 0 of 9
4. (stack i j)
   deleted: (holding i) (clear j)
   added: (clear i) (handempty) (on i j)
   goals met: 0 of 9
5. (unstack h f)
   deleted: (clear h) (handempty) (on h f)
   added: (holding h) (clear f)
   goals met: 0 of 9
6. (stack h c)
   deleted: (holding h) (clear c)
   added: (clear h) (handempty) (on h c)
   goals met: 1 of 9
7. (unstack f d)
   deleted: (clear f) (handempty) (on f d)
   added: (holding f) (clear d)
   goals met: 1 of 9
8. (stack f h)
   deleted: (holding f) (clear h)
   added: (clear f) (handempty) (on f h)
   goals met: 1 of 9
9. (unstack d e)
   deleted: (clear d) (handempty) (on d e)
   added: (holding d) (clear e)
   goals met: 1 of 9
10. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 1 of 9
11. (unstack e g)
   deleted: (clear e) (handempty) (on e g)
   added: (holding e) (clear g)
   goals met: 1 of 9
12. (stack e i)
   deleted: (holding e) (clear i)
   added: (clear e) (handempty) (on e i)
   goals met: 2 of 9
13. (unstack g b)
   deleted: (clear g) (handempty) (on g b)
   added: (holding g) (clear b)
   goals met: 2 of 9
14. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 2 of 9
15. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holding b) (clear a)
   goals met: 2 of 9
16. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 2 of 9
17. (unstack e i)
   deleted: (clear e) (handempty) (on e i)
   added: (holding e) (clear i)
   goals met: 1 of 9
18. (stack e b)
   deleted: (holding e) (clear b)
   added: (clear e) (handempty) (on e b)
   goals met: 1 of 9
19. (unstack f h)
   deleted: (clear f) (handempty) (on f h)
   added: (holding f) (clear h)
   goals met: 1 of 9
20. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 1 of 9
21. (unstack h c)
   deleted: (clear h) (handempty) (on h c)
   added: (holding h) (clear c)
   goals met: 0 of 9
22. (put-down h)
   deleted: (holding h)
   added: (clear h) (handempty) (ontable h)
   goals met: 0 of 9
23. (unstack i j)
   deleted: (clear i) (handempty) (on i j)
   added: (holding i) (clear j)
   goals met: 0 of 9
24. (put-down i)
   deleted: (holding i)
   added: (clear i) (handempty) (ontable i)
   goals met: 0 of 9
25. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 0 of 9
26. (stack j d)
   deleted: (holding j) (clear d)
   added: (clear j) (handempty) (on j d)
   goals met: 1 of 9
27. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 1 of 9
28. (stack f j)
   deleted: (holding f) (clear j)
   added: (clear f) (handempty) (on f j)
   goals met: 2 of 9
29. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 2 of 9
30. (stack a f)
   deleted: (holding a) (clear f)
   added: (clear a) (handempty) (on a f)
   goals met: 3 of 9
31. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 3 of 9
32. (stack c a)
   deleted: (holding c) (clear a)
   added: (clear c) (handempty) (on c a)
   goals met: 4 of 9
33. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 4 of 9
34. (stack h c)
   deleted: (holding h) (clear c)
   added: (clear h) (handempty) (on h c)
   goals met: 5 of 9
35. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 5 of 9
36. (stack g h)
   deleted: (holding g) (clear h)
   added: (clear g) (handempty) (on g h)
   goals met: 6 of 9
37. (pick-up i)
   deleted: (ontable i) (clear i) (handempty)
   added: (holding i)
   goals met: 6 of 9
38. (stack i g)
   deleted: (holding i) (clear g)
   added: (clear i) (handempty) (on i g)
   goals met: 7 of 9
39. (unstack e b)
   deleted: (clear e) (handempty) (on e b)
   added: (holding e) (clear b)
   goals met: 7 of 9
40. (stack e i)
   deleted: (holding e) (clear i)
   added: (clear e) (handempty) (on e i)
   goals met: 8 of 9
41. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 8 of 9
42. (dead-end-stack b e)
   deleted: (holding b) (clear e)
   added: (clear b) (on b e)
   goals met: 9 of 9
